{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# A. Значения функции\n",
    "Ограничение времени\t0.4 секунды\n",
    "Ограничение памяти\t64Mb\n",
    "Ввод\tстандартный ввод или input.txt\n",
    "Вывод\tстандартный вывод или output.txt\n",
    "Вася делает тест по математике: вычисляет значение функций в различных точках. Стоит отличная погода, и друзья зовут Васю гулять. Но мальчик решил сначала закончить тест и только после этого идти к друзьям. К сожалению, Вася пока не умеет программировать. Зато вы умеете. Помогите Васе написать код функции, вычисляющей y = ax^2 + bx + c. Напишите программу, которая будет по коэффициентам a, b, c и числу x выводить значение функции в точке x.\n",
    "\n",
    "Формат ввода\n",
    "На вход через пробел подаются числа a, x, b, c. В конце ввода находится перенос строки.\n",
    "\n",
    "Формат вывода\n",
    "Выведите одно число — значение функции в точке x.\n",
    "Пример 1\n",
    "Ввод\t        Вывод\n",
    "-8 -5 -2 7      -183\n",
    "Пример 2\n",
    "Ввод\t        Вывод\n",
    "8 2 9 -10       40"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "a, x, b, c = map(int, input().split())\n",
    "print((a*(x**2)) + b*x + c)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# B. Чётные и нечётные числа\n",
    "Ограничение времени\t0.15 секунд\n",
    "Ограничение памяти\t64Mb\n",
    "Ввод\tстандартный ввод или input.txt\n",
    "Вывод\tстандартный вывод или output.txt\n",
    "Алла придумала такую онлайн-игру: игрок нажимает на кнопку, и на экране появляются три случайных числа. Если все три числа оказываются одной чётности, игрок выигрывает.\n",
    "\n",
    "Напишите программу, которая по трём числам определяет, выиграл игрок или нет.\n",
    "\n",
    "### Формат ввода\n",
    "В первой строке записаны три случайных целых числа a, b и c. Числа не превосходят 109 по модулю.\n",
    "\n",
    "### Формат вывода\n",
    "Выведите «WIN», если игрок выиграл, и «FAIL» в противном случае.\n",
    "\n",
    "### Пример 1\n",
    "Ввод\tВывод\n",
    "1 2 -3\n",
    "FAIL\n",
    "### Пример 2\n",
    "Ввод\tВывод\n",
    "7 11 7\n",
    "WIN\n",
    "### Пример 3\n",
    "Ввод\tВывод\n",
    "6 -2 0\n",
    "WIN"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import numpy\n",
    "from typing import List, Tuple, Optional\n",
    "\n",
    "def modulo(arr):\n",
    "    modulo = 0\n",
    "    count_p = 0\n",
    "    count_n = 0\n",
    "    for i in range(0, len(arr)):\n",
    "        modulo = arr[i] % 2\n",
    "        if modulo == 0:\n",
    "            count_p += 1\n",
    "        else:\n",
    "            count_n += 1\n",
    "        return count_p, count_n\n",
    "\n",
    "def read_input() ->  List[int]:\n",
    "    arr = list(map(int, input().strip().split()))\n",
    "    return arr\n",
    "\n",
    "def print_result(positive: Optional int, negative: Optional int):\n",
    "    if count_p or count_n == 3:\n",
    "        print 'Win'\n",
    "    else:\n",
    "        print 'FAIL'\n",
    "\n",
    "arr = read_input()\n",
    "print_result(modulo(arr))"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
