{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# A. Значения функции"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Ограничение времени\t0.4 секунды\n",
    "Ограничение памяти\t64Mb\n",
    "Ввод\tстандартный ввод или input.txt\n",
    "Вывод\tстандартный вывод или output.txt"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Вася делает тест по математике: вычисляет значение функций в различных точках. Стоит отличная погода, и друзья зовут Васю гулять. Но мальчик решил сначала закончить тест и только после этого идти к друзьям. К сожалению, Вася пока не умеет программировать. Зато вы умеете. Помогите Васе написать код функции, вычисляющей y = ax^2 + bx + c. Напишите программу, которая будет по коэффициентам a, b, c и числу x выводить значение функции в точке x.\n",
    "\n",
    "Формат ввода\n",
    "На вход через пробел подаются числа a, x, b, c. В конце ввода находится перенос строки.\n",
    "\n",
    "Формат вывода\n",
    "Выведите одно число — значение функции в точке x."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Пример 1\n",
    "Ввод\t        Вывод\n",
    "-8 -5 -2 7      -183\n",
    "Пример 2\n",
    "Ввод\t        Вывод\n",
    "8 2 9 -10       40"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "a, x, b, c = map(int, input().split())\n",
    "print((a*(x**2)) + b*x + c)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# C. Скользящее среднее"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Ограничение времени\t1 секунда\n",
    "Ограничение памяти\t64Mb\n",
    "Ввод\tстандартный ввод или input.txt\n",
    "Вывод\tстандартный вывод или output.txt"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Вам дана статистика по числу запросов в секунду к вашему любимому рекомендательному сервису.\n",
    "\n",
    "Измерения велись n секунд.\n",
    "\n",
    "В секунду i поступает q_i запросов.\n",
    "\n",
    "Примените метод скользящего среднего с длиной окна k к этим данным и выведите результат."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##  Формат ввода\n",
    "В первой строке передаётся натуральное число n, количество секунд, в течение которых велись измерения. 1 ≤ n ≤ 10^5\n",
    "\n",
    "Во второй строке через пробел записаны n целых неотрицательных чисел q_i, каждое лежит в диапазоне от 0 до 10^3.\n",
    "\n",
    "В третьей строке записано натуральное число k (1 ≤ k ≤ n) —– окно сглаживания.\n",
    "\n",
    "Примечание для Go:\n",
    "\n",
    "Заметьте, что в данной задаче достаточно большой размер ввода. Поэтому необходимо задавать размер буфера для сканнера хотя бы 600 Кб."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Формат вывода\n",
    "Выведите через пробел результат применения метода скользящего среднего к серии измерений. Должно быть выведено n - k + 1 элементов, каждый элемент -— вещественное (дробное) число.\n",
    "\n",
    "Пример 1\n",
    "Ввод\t            Вывод\n",
    "7                   2.5 3.5 4.5 5.5\n",
    "1 2 3 4 5 6 7\n",
    "4\n",
    "\n",
    "Пример 2\n",
    "9                   4.6666666667 1.666666667 1 2 2.333333335 2 0.3333333\n",
    "9 3 2 0 1 5 1 0 0\n",
    "3\n",
    "\n",
    "Пример 3\n",
    "Ввод\t            Вывод\n",
    "5                   3\n",
    "1 2 3 4 5\n",
    "5\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "n = int(input())                       # Считывание первой строки ввода\n",
    "arr = list(map(int, input().split()))  # Считывание второй строки ввода\n",
    "K = int(input())                       # Считывание третьей строки ввода\n",
    "result = []  # Пустой массив.\n",
    "# Первый раз вычисляем значение честно и сохраняем результат.\n",
    "current_sum = sum(arr[0:K])\n",
    "result.append(current_sum / K)\n",
    "for i in range(0, n - K):\n",
    "    current_sum -= arr[i]\n",
    "    current_sum += arr[i+K]\n",
    "    current_avg = current_sum / K\n",
    "    result.append(current_avg)\n",
    "print(\" \".join(list(map(str, result)))) # Выводит массив через пробел\n",
    "\n",
    "\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
